<a href="https://colab.research.google.com/github/Bhavani-Rajan/DS-Unit-1-Sprint-1-Dealing-With-Data/blob/master/Practice_assignment_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This coding challenge will walk you through the basics of Python 3 and Pandas library. 

Repl.it uses automatic unit tests to determine the correctness of your answer. On the left hand side you see the IDE and the console output windows. You execute your code by pressing the RUN button - you can do this as many times as you like. 

When you're ready, move on to the NEXT button to check your answers against the unit tests and submit your work for grading. Please make sure to submit your work (even if incomplete) before 8:45 PST so we can take attendance. Have fun!


Task 1: 
Your first task is to import the Pandas library, as we must install libraries (also called packages or modules) that support the functionality we need (in this case loading datasets in various formats). Remember the "iconic trio"?

Good detailed resource here: https://www.digitalocean.com/community/tutorials/how-to-import-modules-in-python-3


Task 2:
The second task is to load different file types for further processing and print out the first 5 rows. You will soon find that in data science, your datasets will come in various shapes and forms. Very frequently we use the .CSV (comma-separated values) format, however there are many others. 

Now let's test out loading and displaying a few different types in data. Load these three datasets and display the first five rows for each.

Hint: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html

Dataset 1: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv

Dataset 2: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/PeopleInSpaceNow.json

Dataset 3: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv


Stretch Goals: 
Load the Dataset 1 into a colab notebook and answer the following questions. When you are finished, add a link to your Colab notebook to the top of the code challenge as a comment.

1) Clean the data set and drop the Null/NaN values. Rename  Product_Category_1-3 columns with an actual Product. 

2) How many unique user_ids does the data set contain?

3) How many unique age brackets are in the dataset. Which Age bracket has the most entries? Which has the least?

4) Transform the Gender categorical variable into a numerical variable. Then transform that numerical value into a Boolean.

5)What is the average Occupation score? What is the Standard Deviation? What is the maximum and minimum value?

7) Group Age by Gender and print out a cross tab with age as the y axis


Super Stretch Goals: 
Build a linear regression model to predict the purchase amount given the other features in the data set with scikit learn. Try to get the best accuracy score using this metric: https://scikit-learn.org/stable/modules/generated/sklearn.metrics.accuracy_score.html

In [0]:
# Task 1 - Pandas Library Import here: 
##Your Code Here
import pandas as pd

In [6]:
# Task 2 - Load three datasets and display 5 rows of data for each:
##Your Code Here

# black friday dataset
black_friday_url = 'https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv'
black_friday_data = pd.read_csv(black_friday_url)
black_friday_data.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969

[5 rows x 12 columns]

In [13]:
# ppl in space now
ppl_space_url = 'https://raw.githubusercontent.com/pierretd/datasets-1/master/PeopleInSpaceNow.json'
ppl_space_data = pd.read_json(ppl_space_url) 
ppl_space_data.head()

                                              people  message  number
0       {'name': 'Sergey Prokopyev', 'craft': 'ISS'}  success       3
1        {'name': 'Alexander Gerst', 'craft': 'ISS'}  success       3
2  {'name': 'Serena Aunon-Chancellor', 'craft': '...  success       3

In [12]:
# Fast fm profiles
fast_profile_url ='https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv'
fast_profile_data = pd.read_csv(fast_profile_url, sep='\t')
fast_profile_data.head()

           #id gender   age        country    registered
0  user_000001      m   NaN          Japan  Aug 13, 2006
1  user_000002      f   NaN           Peru  Feb 24, 2006
2  user_000003      m  22.0  United States  Oct 30, 2005
3  user_000004      f   NaN            NaN  Apr 26, 2006
4  user_000005      m   NaN       Bulgaria  Jun 29, 2006

In [15]:
#Stretch Goal
##Your Code Here

from google.colab import files
uploaded = files.upload()

Saving BlackFriday.csv to BlackFriday.csv

In [16]:
df = pd.read_csv('BlackFriday.csv')
df.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969

[5 rows x 12 columns]

In [20]:
df.describe()

            User_ID    Occupation  ...  Product_Category_3       Purchase
count  5.375770e+05  537577.00000  ...       164278.000000  537577.000000
mean   1.002992e+06       8.08271  ...           12.669840    9333.859853
std    1.714393e+03       6.52412  ...            4.124341    4981.022133
min    1.000001e+06       0.00000  ...            3.000000     185.000000
25%    1.001495e+06       2.00000  ...            9.000000    5866.000000
50%    1.003031e+06       7.00000  ...           14.000000    8062.000000
75%    1.004417e+06      14.00000  ...           16.000000   12073.000000
max    1.006040e+06      20.00000  ...           18.000000   23961.000000

[8 rows x 7 columns]

In [19]:
df.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [0]:
df = df.dropna(how='any',axis=0)

In [22]:
df.isna().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
dtype: int64

In [23]:
df.rename(columns={'Product_Category_1':'Electronics',
                   'Product_Category_2' :'Fashion',
                   'Product_Category_3':'shoes'})
df.head()

    User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
1   1000001  P00248942      F  ...                6.0                14.0    15200
6   1000004  P00184942      M  ...                8.0                17.0    19215
13  1000005  P00145042      M  ...                2.0                 5.0    15665
14  1000006  P00231342      F  ...                8.0                14.0     5378
16  1000006   P0096642      F  ...                3.0                 4.0    13055

[5 rows x 12 columns]

In [0]:
#Super Stretch Goal
##Your Code Here